betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_adc_ex.h
/** @defgroup ADCEx_External_trigger_edge_Injected ADC External Trigger Edge Injected
  * @{
  */
#define ADC_EXTERNALTRIGINJECCONVEDGE_NONE           0x00000000U
#define ADC_EXTERNALTRIGINJECCONVEDGE_RISING         ((uint32_t)ADC_CTRL2_INJEXTTRGEN_0)
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define ADC_EXTERNALTRIGINJECCONVEDGE_FALLING        ((uint32_t)ADC_CTRL2_INJEXTTRGEN_1)
#define ADC_EXTERNALTRIGINJECCONVEDGE_RISINGFALLING  ((uint32_t)ADC_CTRL2_INJEXTTRGEN)
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup ADCEx_External_trigger_Source_Injected ADC External Trigger Source Injected
  * @{
  */
#if defined(APM32F403xx) || defined(APM32F402xx)
/*!< External triggers of injected group for ADC1&ADC2 only */
#define ADC1_2_EXTERNALTRIGINJEC_T2_TRGO            ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL_1)
#define ADC1_2_EXTERNALTRIGINJEC_T2_CC1             ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0))
#define ADC1_2_EXTERNALTRIGINJEC_T3_CC4             ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL_2)
#define ADC1_2_EXTERNALTRIGINJEC_T4_TRGO            ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_0))
#define ADC1_2_EXTERNALTRIGINJEC_EXT_IT15           ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1))

/* External triggers of injected group for ADC3 */
#define ADC3_EXTERNALTRIGINJEC_T4_CC3               ADC1_2_EXTERNALTRIGINJEC_T2_TRGO
#define ADC3_EXTERNALTRIGINJEC_T8_CC2               ADC1_2_EXTERNALTRIGINJEC_T2_CC1
#define ADC3_EXTERNALTRIGINJEC_T8_CC4               ADC1_2_EXTERNALTRIGINJEC_T3_CC4
#define ADC3_EXTERNALTRIGINJEC_T5_TRGO              ADC1_2_EXTERNALTRIGINJEC_T4_TRGO
#define ADC3_EXTERNALTRIGINJEC_T5_CC4               ADC1_2_EXTERNALTRIGINJEC_EXT_IT15

/* External triggers of injected group for ADC1&ADC2&ADC3 (if ADCx available) */
#define ADC1_2_3_EXTERNALTRIGINJEC_T1_TRGO          0x00000000U
#define ADC1_2_3_EXTERNALTRIGINJEC_T1_CC4           ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL_0)
#define ADC1_2_3_JSWSTART                           ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0))

/*!< External triggers of injected group for ADC1&ADC2 only */
#define ADC_EXTERNALTRIGINJECCONV_T2_TRGO           ADC1_2_EXTERNALTRIGINJEC_T2_TRGO
#define ADC_EXTERNALTRIGINJECCONV_T2_CC1            ADC1_2_EXTERNALTRIGINJEC_T2_CC1
#define ADC_EXTERNALTRIGINJECCONV_T3_CC4            ADC1_2_EXTERNALTRIGINJEC_T3_CC4
#define ADC_EXTERNALTRIGINJECCONV_T4_TRGO           ADC1_2_EXTERNALTRIGINJEC_T4_TRGO
#define ADC_EXTERNALTRIGINJECCONV_EXT_IT15          ADC1_2_EXTERNALTRIGINJEC_EXT_IT15

/* External triggers of injected group for ADC3 */
#define ADC_EXTERNALTRIGINJECCONV_T4_CC3            ADC3_EXTERNALTRIGINJEC_T4_CC3
#define ADC_EXTERNALTRIGINJECCONV_T8_CC2            ADC3_EXTERNALTRIGINJEC_T8_CC2
#define ADC_EXTERNALTRIGINJECCONV_T8_CC4            ADC3_EXTERNALTRIGINJEC_T8_CC4
#define ADC_EXTERNALTRIGINJECCONV_T5_TRGO           ADC3_EXTERNALTRIGINJEC_T5_TRGO
#define ADC_EXTERNALTRIGINJECCONV_T5_CC4            ADC3_EXTERNALTRIGINJEC_T5_CC4

/* External triggers of injected group for ADC1&ADC2&ADC3 (if ADCx available) */
#define ADC_EXTERNALTRIGINJECCONV_T1_TRGO           ADC1_2_3_EXTERNALTRIGINJEC_T1_TRGO
#define ADC_EXTERNALTRIGINJECCONV_T1_CC4            ADC1_2_3_EXTERNALTRIGINJEC_T1_CC4
#define ADC_INJECTED_SOFTWARE_START                 ADC1_2_3_JSWSTART
#else
#define ADC_EXTERNALTRIGINJECCONV_T1_CC4            0x00000000U
#define ADC_EXTERNALTRIGINJECCONV_T1_TRGO           ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL_0)
#define ADC_EXTERNALTRIGINJECCONV_T2_CC1            ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL_1)
#define ADC_EXTERNALTRIGINJECCONV_T2_TRGO           ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGINJECCONV_T3_CC2            ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL_2)
#define ADC_EXTERNALTRIGINJECCONV_T3_CC4            ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGINJECCONV_T4_CC1            ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1))
#define ADC_EXTERNALTRIGINJECCONV_T4_CC2            ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGINJECCONV_T4_CC3            ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL_3)
#define ADC_EXTERNALTRIGINJECCONV_T4_TRGO           ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGINJECCONV_T5_CC4            ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_1))
#define ADC_EXTERNALTRIGINJECCONV_T5_TRGO           ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_1 | ADC_CTRL2_INJGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGINJECCONV_T8_CC2            ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_2))
#define ADC_EXTERNALTRIGINJECCONV_T8_CC3            ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_0))
#define ADC_EXTERNALTRIGINJECCONV_T8_CC4            ((uint32_t)(ADC_CTRL2_INJGEXTTRGSEL_3 | ADC_CTRL2_INJGEXTTRGSEL_2 | ADC_CTRL2_INJGEXTTRGSEL_1))
#define ADC_EXTERNALTRIGINJECCONV_EXT_IT15          ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL)
#define ADC_INJECTED_SOFTWARE_START                 ((uint32_t)ADC_CTRL2_INJGEXTTRGSEL + 1U)
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup ADCEx_injected_rank ADC Injected Rank
  * @{
  */
#define ADC_INJECTED_RANK_1    0x00000001U
#define ADC_INJECTED_RANK_2    0x00000002U
#define ADC_INJECTED_RANK_3    0x00000003U
#define ADC_INJECTED_RANK_4    0x00000004U
/**
  * @}
  */

/** @defgroup ADCEx_channels  ADC Specific Channels
  * @{
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define ADC_CHANNEL_TEMPSENSOR  ((uint32_t)ADC_CHANNEL_16)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F411xx)
#define ADC_CHANNEL_DIFFERENCIATION_TEMPSENSOR_VBAT 0x10000000U /* Dummy bit for driver internal usage, not used in ADC channel setting registers CTRL1 or REGSEQx */
#define ADC_CHANNEL_TEMPSENSOR  ((uint32_t)ADC_CHANNEL_18 | ADC_CHANNEL_DIFFERENCIATION_TEMPSENSOR_VBAT)
#endif /* APM32F411xx */
/**
  * @}
  */


/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup ADC_Exported_Macros ADC Exported Macros
  * @{
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ADCEx_Exported_Functions
  * @{
  */

